
#### :building_construction: Terraform Plan
```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.tenant["franzfreunde-R70"].module.tunnel.netbox_asn.device[0] will be created
  + resource "netbox_asn" "device" {
      + asn         = 4200000677
      + description = "R70 (FranzFreunde)"
      + id          = (known after apply)
      + rir_id      = 12
      + tags_all    = (known after apply)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "CR3:CR3-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 35 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
        name            = "CR3-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/35/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "CR4:CR4-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 31 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
        name            = "CR4-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/31/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T22:11:39Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 188 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:55Z" -> (known after apply)
        name            = "CR5-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/188/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "CR6:CR6-R70-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 37 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:56Z" -> (known after apply)
        name            = "CR6-R70-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/37/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "CR3:CR3-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 41 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:53Z" -> (known after apply)
        name            = "CR3-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/41/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "CR4:CR4-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 43 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:57Z" -> (known after apply)
        name            = "CR4-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/43/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T22:11:39Z" -> (known after apply)
      + device          = (known after apply)
      ~ display         = "CR5:CR5-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 189 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:57Z" -> (known after apply)
        name            = "CR5-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/189/" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.core_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "core_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "CR6:CR6-R70-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 42 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:57Z" -> (known after apply)
        name            = "CR6-R70-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ remote_as       = 16 -> (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/42/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR3-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 33 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:53Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR3-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/33/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "R70:R70-CR4-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 32 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:54Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR4-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/32/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "R70:R70-CR5-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 29 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:53Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR5-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/29/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v4["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v4" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:14Z" -> (known after apply)
      ~ display         = "R70:R70-CR6-v4" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 30 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:54Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR6-v4"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/30/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR3"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR3-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 38 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:56Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR3-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/38/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR4"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR4-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 39 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:53Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR4-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/39/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR5"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:15Z" -> (known after apply)
      ~ display         = "R70:R70-CR5-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 34 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:56Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR5-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/34/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.tenant["franzfreunde-R70"].module.tunnel.netboxbgp_session.device_v6["CR6"] will be updated in-place
  ~ resource "netboxbgp_session" "device_v6" {
      + comments        = (known after apply)
      ~ created         = "2025-12-07T19:03:16Z" -> (known after apply)
      ~ display         = "R70:R70-CR6-v6" -> (known after apply)
      + export_policies = (known after apply)
      ~ id              = 40 -> (known after apply)
      + import_policies = (known after apply)
      ~ last_updated    = "2025-12-19T22:14:53Z" -> (known after apply)
      ~ local_as        = 16 -> (known after apply)
        name            = "R70-CR6-v6"
      + peer_group      = (known after apply)
      + prefix_list_in  = (known after apply)
      + prefix_list_out = (known after apply)
      ~ status          = "active" -> (known after apply)
      ~ tags            = [] -> (known after apply)
      ~ url             = "https://netbox.freifunk-duesseldorf.de/api/plugins/bgp/bgpsession/40/" -> (known after apply)
      + virtualmachine  = (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 16 to change, 0 to destroy.
```